buyflix/app/views/movies/show.html.erb

SELECT  "actors".* FROM "actors"  WHERE "actors"."actor_id" = 3 LIMIT 1
---
<% @roles.each do|role| %>
<% actor=Actor.find_by(id: role.actor_id) %>