buyflix/app/controllers/movies_controller.rb

  def show
  	@movie = Movie.find_by(id: params["id"])
	@roles = Role.where(movie_id: params["id"])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = 3 LIMIT 1
SELECT  "roles".* FROM "roles"  WHERE "roles"."movie_id" = 3 LIMIT 1